# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)
print(float('inf') == float('inf') ** 2 and float('inf') == float('inf') * 2 and float('inf') > 999999)
print('Искомое число = float(''inf'') или бесконечность')